Symbolics/Derivatives.tex
% Created 2021-10-30 Sat 14:35
% Intended LaTeX compiler: xelatex
\documentclass[12pt]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
% \usepackage[utf8]{inputenc}
\usepackage[mathletters]{ucs}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{eurosym}
\usepackage[T1]{fontenc}
% \usepackage{Alegreya} %% Option 'black' gives heavier bold face 
% \renewcommand*\oldstylenums[1]{{\AlegreyaOsF #1}}
% \setmonofont{} %CMU Typewriter Text

\usepackage{hyperref}
\hypersetup{colorlinks, allcolors=., colorlinks=true,linkcolor={blue!78!white}, urlcolor={purple}, filecolor={winered}}
\usepackage{xcolor} % to access the named colour LightGray
\definecolor{LightGray}{gray}{0.2}
\usepackage{minted}
\usemintedstyle{monokai}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{Setup}
\label{sec:orgddbcd56}
\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{julia}
using Pkg;
Pkg.activate("~/EEL-USP/Symbolics/")
Pkg.add("Plots")
Pkg.add("Symbolics")
Pkg.add("StaticArrays")
\end{minted}

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{julia}
using Symbolics
using Plots
using StaticArrays
\end{minted}

\section{Escrevendo as derivadas \textbf{simbólicas}}
\label{sec:org500faaf}
Vamos criar duas funções, a \texttt{derivative} e a \texttt{derivative\_symb} as quais computam tanto o valor numérico, quanto retornam a expressão simbólica (literal) e uma função chamável em Julia.

Se não ficou claro, acompanhe o tutorial. 

\clearpage
\subsection{Funções ajudantes}
\label{sec:orgbbb7933}
Criaremos as funções ajudantes, utilizando do pacote \texttt{Symbolics.jl}. Os detalhes do porquê essas funções são definitas dessa maneira vão além do escopo do tutorial, mas deixamos aqui como documentação.

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{julia}
function derivative(exp, ξ)
      @variables y
      Dy=Differential(y)
      ϕe = exp(y) # (
      return first(substitute.(expand_derivatives(Dy(ϕe)),(Dict(y => ξ),)))
  end
\end{minted}

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray, mathescape]{julia}
function derivative_symb(exp)
    @variables ξ
    Dξ=Differential(ξ)
    ϕe = exp(ξ) # (
    return (eval(build_function(expand_derivatives(Dξ(ϕe)), ξ)),
    expand_derivatives(Dξ(ϕe)))
end
\end{minted}

\subsection{Como avaliar uma derivada}
\label{sec:orgb283cdb}
Consideraremos a função \(f(x)\), a seguir, como exemplo,

\begin{equation}
\begin{aligned}
f(x) = 0.1 \, \sin(x) + 2\,\sin(x)^2 - x^2 
\end{aligned}
\end{equation}

Em Júlia,
\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{julia}
f(x) = -x^2 + 0.1*sin(x) + 2*sin(x)^2
\end{minted}


\subsubsection{Avaliando \textbf{numericamente} a derivada}
\label{sec:orgd43ace4}
Avaliemos, como exemplo, a derivada em \(x=1.3\). Isto é,

\begin{equation}
\begin{aligned}
\dfrac{\text{d}f}{\text{d}x}\biggr\rvert_{(x=1.3)} = g(1.3)
\end{aligned}
\end{equation}

Em que \(g\) é uma função derivada.

De forma literal, a função é equivalente a:

\begin{equation}
\begin{aligned}
\dfrac{\text{d}f}{\text{d}x}\biggr\rvert_{(x=1.3)} &= \left[\dfrac{\text{d}(-x^2)}{\text{d}x} +  \dfrac{\text{d}(0.1 \, \sin(x))}{\text{d}x} + \dfrac{\text{d}(2\,\sin(x)^2)}{\text{d}x}  \right]\biggr\rvert_{(x=1.3)} \\
\Leftrightarrow  &=  \left[-2x +  0.1 \, \cos(x) + 2.\dfrac{\text{d}(\,\sin(x)^2)}{\text{d}\sin(x)}.\dfrac{\text{d}(\sin(x))}{\text{d}x}  \right]\biggr\rvert_{(x=1.3)}\\
\Leftrightarrow  \dfrac{\text{d}f}{\text{d}x}\biggr\rvert_{(x=1.3)}&= \left[-2x +  0.1 \, \cos(x) + 2.(2\sin(x)).\cos(x)  \right]\biggr\rvert_{(x=1.3)}\\
\end{aligned}
\end{equation}

Ou seja, gostaríamos de obter a função \(g\), \(g(x) =-2x +  0.1 \,
\cos(x) + 4\sin(x).\cos(x)\) com ferramentas computacionais.

Em \texttt{Julia}, temos,

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{julia}
derivative(f, 1.3)
\end{minted}

\subsubsection{Avaliando a derivada \textbf{simbolicamente}}
\label{sec:orgfe07427}
A vantagem de avaliarmos a derivada simbolicamente é que podemos obter
uma expressão literal para derivada e ao mesmo tempo definir uma
função em \texttt{Julia} a qual é equivalente a função derivada.

Isto é, definiremos a função \(g\) em \hyperref[sec:orgd43ace4]{Sec. numérica}, e saberemos qual é sua expressão simbólica.

A função \texttt{derivative\_symb} nos retorna dois valores em uma tupla:

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{julia}
derivative_symb(f)
\end{minted}

O primeiro valor da tupla é como \texttt{Julia} representa uma função anônima
(explícita, mas sem nome) que pode ser passado para uma função com
nome, como por exemplo \(g\).

O segundo valor é a expressão da derivada literal, utilizando-se da
regra da cadeia. Note que o símbolo \(\xi\) foi utilizado para denotar a
variável, na expressão (em nossa \(f\) a variável independente é \(x\)).

\begin{enumerate}
\item Definindo a função-derivada internamente em Julia
\label{sec:org3664dd4}

Tudo que precisamos fazer, agora, é definir a função-derivada \(g\),
passando o primeiro argumento retornado de \texttt{derivative\_symb}.

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{julia}
g = first(derivative_symb(f))
\end{minted}

Avaliano \(g(1.3)\), temos:

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{julia}
g(1.3)
\end{minted}

\item Obtendo uma expressão em \LaTeX de \(g\)
\label{sec:org847f6ab}
Existe um pacote me \texttt{Julia} chamado \texttt{Latexify.jl}. Podemos utilizá-lo
para renderizar o segundo termo retornado de \texttt{derivative\_symb}.

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{julia}
Pkg.add("Latexify")
\end{minted}


\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{julia}
using Latexify
\end{minted}

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{julia}
latexify(last(derivative_symb(f)))
\end{minted}

Essa expressão, quando renderizada, fica:
\begin{equation}
 - 2 \xi + 0.1 \cos\left( \xi \right) + 4 \cos\left( \xi \right) \sin\left( \xi \right)
\end{equation}
\end{enumerate}

\section{Tangente à uma curva \(\mathbb{R}^2\) (plot)}
\label{sec:orgd4dba6e}
\section{Outros materiais}
\label{sec:org6fcca4e}
\subsection{CalculusWithJulia}
\label{sec:orgde7a408}
\texttt{CalculusWithJulia.jl} utiliza SymPy (interoperabilidade com a
biblioteca em Python) para derivar todos seus resultados.

Esse link \url{https://docs.juliahub.com/CalculusWithJulia/AZHbv/0.0.5/} é
um ótimo recurso para se aprender cálculo, utilizando-se de Julia.
\subsection{Manim}
\label{sec:org98080a5}
Biblioteca de animação em Python utilizado para explicar matemática,
em vídeo. Inicialmente, desenvolvido por \href{https://www.youtube.com/c/3blue1brown}{3Blue1Brown}.
\end{document}